Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: With those requirements in place, the jar can be deployed on the target, along with the required configuration for the app integration into systemd as a service. Any change to the systemd configuration requires reloading its daemon, which the collection ensures will happen whenever it is needed. With all of that in place, the only thing that remains is to start the service itself, which Ansible will also take care of.
ja_jp: これらの要件が揃えば、アプリをサービスとしてsystemdに統合するために必要な設定とともに、jarをターゲットにデプロイすることができます。systemdの設定を変更するには、デーモンをリロードする必要があります。このコレクションは、必要なときにいつでも実行されることを保証します。すべての設定が揃ったので、あとはサービス自体を起動するだけです。

source: Within Quarkus it is possible to apply Kubernetes manifests to the cluster dev service on startup. This is especially useful if your application expects certain resources to be present in the cluster, such as for example a specific namespace or certain Custom Resource Definitions that the application interacts with.
ja_jp: Quarkus では、起動時に Kubernetes マニフェストをクラスター dev service に適用することが可能です。これは、アプリケーションがクラスター内に特定の名前空間や、アプリケーションが対話する特定のカスタムリソース定義などの特定のリソースが存在することを期待する場合に特に役立ちます。

source: Within a dev mode session or test suite execution, Quarkus will always reuse Elasticsearch Dev Services as long as their configuration (username, password, environment, port bindings, ...) did not change.
ja_jp: 開発モードセッションまたはテストスイートの実行において、 Quarkus は設定 (ユーザー名、パスワード、環境、ポートバインディングなど) が変更されない限り、常にデータベースの Elasticsearch Dev Services を再利用します。

source: Within a dev mode session or test suite execution, Quarkus will always reuse database Dev Services as long as their configuration (username, password, environment, port bindings, ...) did not change.
ja_jp: 開発モードセッションまたはテストスイートの実行において、 Quarkusは設定（ユーザー名、パスワード、環境、ポートバインディングなど）が変更されない限り、常にデータベースのDev Servicesを再利用します。

source: Within each group, all the measurements of that station are aggregated, by keeping track of minimum and maximum values and calculating the average value of all measurements of that station (see the `Aggregation` type)
ja_jp: 各グループ内では、最小値と最大値を記録し、その局のすべての測定値の平均値を計算することによって、その局のすべての測定値が集約されます ( `Aggregation` タイプを参照)。

source: Within the tooling container, run _kafkacat_ to examine the results of the streaming pipeline:
ja_jp: ツールコンテナー内で、 _kafkacatを_ 実行して、ストリーミングパイプラインの結果を調べます:

source: Without a termination setting or a termination event, the solver runs forever. To avoid that, limit the solving time to five seconds. That is short enough to avoid the HTTP timeout.
ja_jp: 終了設定または終了イベントがない場合、ソルバーは永久に実行されます。これを回避するには、解決時間を 5 秒に制限します。これは、HTTP タイムアウトを回避するのに十分な短さです。

source: Without an extension, JDBC drivers are expected to work correctly in JVM mode. However, they are unlikely to function when compiling your application into a native executable. To build a native executable, use an existing Quarkus JDBC extension or contribute a new extension for your driver.
ja_jp: エクステンションがない場合、JDBC ドライバーは JVM モードで正しく動作することが期待されます。 ただし、アプリケーションをネイティブ実行可能ファイルにコンパイルするときには機能しない可能性があります。 ネイティブ実行可能ファイルをビルドするには、既存の Quarkus JDBC エクステンションを使用するか、ドライバー用の新しいエクステンションを提供します。

source: Without an extension, the driver will work correctly in any Quarkus app running in JVM mode. However, the driver is unlikely to work when compiling your application to a native executable. If you plan to make a native executable, use the existing JDBC Quarkus extensions, or contribute one for your driver.
ja_jp: エクステンションがない場合、ドライバはJVMモードで実行されているQuarkusアプリで正しく動作します。 しかし、アプリケーションをネイティブ実行可能ファイルにコンパイルする場合、ドライバが動作する可能性は低くなります。 ネイティブ実行可能ファイルを作成する場合は、既存のJDBC Quarkusエクステンションを使用するか、ドライバ用にエクステンションを作成してください。

source: Without an extension, the driver will work fine in any Quarkus app running in JVM mode. It is unlikely that it will work when compiling your application to a native executable though. If you plan to make a native executable, we recommend you use the existing JDBC Quarkus extensions (or contribute one for your driver).
ja_jp: 拡張がない場合でも、JVM モードで実行されている Quarkus アプリであれば、ドライバーは問題なく動作します。しかし、アプリケーションをネイティブ実行可能ファイルにコンパイルした場合には動作しません。ネイティブ実行可能ファイルを作成する予定がある場合は、既存の JDBC Quarkus エクステンションを使用することをお勧めします (または、ドライバー用のエクステンションを提供することをお勧めします)。

source: Without configuration, Flyway is set up for every datasource using the default settings.
ja_jp: 設定なしの場合、Flyway はデフォルト設定を使用して各データソースに対して設定されます。

source: Without configuration, Liquibase is set up for every datasource using the default settings.
ja_jp: 設定をしないと、Liquibaseはデフォルトの設定で各データソースに設定されます。

source: Without that configuration, reindexing through the management endpoint (or through any other API) will fail.
ja_jp: この設定がない場合、管理エンドポイント (または他の API) を介してインデックスの再作成を行うと、 失敗します。

source: Without the `@WithParentName` the method `name()` requires the configuration property `server.info.name`. Because we use `@WithParentName`, the `info()` mapping will inherit the parent name from `Server` and `name()` maps to `server.name` instead.
ja_jp: `@WithParentName` を使用しない場合、メソッド `name()` は設定プロパティ `server.info.name` を必要とします。 `@WithParentName` を使用しているため、 `info()` のマッピングは `Server` から親の名前を継承し、 `name()` は代わりに `server.name` にマッピングします。

source: Wizards w/code.quarkus.io
ja_jp: code.quarkus.ioのウィザード

source: Wondering why we must block until the latest query is completed? This code is part of a method that `@Observes` the `StartupEvent` and Quarkus invokes it synchronously. As a consequence, returning prematurely could lead to serving requests while the database is not ready yet.
ja_jp: 最新のクエリーが完了するまでブロックする必要があるのはなぜでしょうか? このコードは、 `StartupEvent` を `@Observes` し、Quarkus がそれを同期的に呼び出すメソッドの一部です。 その結果、時期尚早に戻ると、データベースがまだ準備できていない状態でリクエストが処理される可能性があります。

source: Wondering why we need block until the latest query is completed? This code is part of a `@PostConstruct` method and Quarkus invokes it synchronously. As a consequence, returning prematurely could lead to serving requests while the database is not ready yet.
ja_jp: 最新のクエリーが完了するまでブロックが必要なのはなぜですか? このコードは `@PostConstruct` メソッドの一部であり、Quarkus はそれを同期的に呼び出します。結果として、返すのが早すぎると、データベースの準備ができていないときにリクエストを処理する可能性があります。

source: Words of Wisdom
ja_jp: 金言

source: Work around missing CPU features
ja_jp: 不足しているCPU機能を回避

source: Work is done at augmentation time by _build steps_ which produce and consume _build items_. The build steps found in the deployment modules that correspond to the extensions in the project build are automatically wired together and executed to produce the final build artifact(s).
ja_jp: 作業は、 _ビルドアイテム_ を生成・消費する _ビルドステップ_ によって拡張時に行われます。プロジェクトビルドのエクステンションに対応するデプロイメント・モジュール内のビルドステップは、自動的に接続され、最終的なビルドアーティファクトを生成するために実行されます。

source: Work with cached values
ja_jp: キャッシュされた値を扱う

source: Worker thread
ja_jp: ワーカースレッド

source: Worker threads: they are pooled and can be used to offload long-running operations
ja_jp: ワーカースレッド: プールされ、長時間実行される操作の負荷を軽減するために使用できます

source: Worker-threads
ja_jp: ワークスレッド

source: Working Groups
ja_jp: ワーキング・グループ

source: Working Kogito and OptaPlanner are back in Quarkus 2.6.2.Final.
ja_jp: 動作するのKogitoとOptaPlannerがQuarkus 2.6.2.Finalで復活しました。

source: Working with HashiCorp Vault’s Authentication
ja_jp: HashiCorp Vaultの認証との連携

source: Working with Kotlin Data classes
ja_jp: Kotlin のデータクラスで作業する

source: Working with OpenShift serving certificates
ja_jp: OpenShift 提供証明書の使用

source: Working with batch query results
ja_jp: バッチクエリー結果の操作

source: Working with brownfield applications
ja_jp: ブラウンフィールドでの活用

source: Working with containers
ja_jp: コンテナーへの対応

source: Working with extensions
ja_jp: エクステンションの使用

source: Working with multi-module project or external modules
ja_jp: マルチモジュールプロジェクトや外部モジュールとの連携

source: Working with multi-module projects
ja_jp: マルチモジュールプロジェクトでの作業

source: Workload Projection is a process of obtaining the configuration for services from the Kubernetes cluster. This configuration takes the form of directory structures that follow certain conventions and is attached to an application or to a service as a mounted volume. The `kubernetes-service-binding` extension uses this directory structure to create configuration sources, which allows you to configure additional modules, such as databases or message brokers.
ja_jp: Workload Projection は、Kubernetes クラスターからのサービスの設定を取得するプロセスです。この設定は、特定の規約に従ったディレクトリー構造の形式をとり、アプリケーションまたはサービスにマウントされたボリュームとしてアタッチされます。`kubernetes-service-binding` エクステンションは、このディレクトリー構造を利用して設定ソースを作成し、これにより、データベースやメッセージブローカーなどの追加モジュールを設定することができます。

source: Works as a native application
ja_jp: ネイティブアプリケーションとしての実行

source: Works in JVM mode
ja_jp: JVM モードで動作

source: Works in dev mode
ja_jp: 開発モードで動作します

source: Works with Quarkus 1.1.1
ja_jp: Quarkus 1.1.1 で動作

source: Workspace
ja_jp: ワークスペース

source: Workspace participation
ja_jp: ワークスペースへの参加

source: Workspace-based assistant actions
ja_jp: ワークスペースベースのアシスタントアクション

source: World Tour
ja_jp: ワールドツアー

source: World Tour - Abstracts and Support materials.
ja_jp: ワールドツアー - 概要とサポートマテリアル

source: World Tour - Sound Check... Getting Started with Quarkus.
ja_jp: ワールドツアー - サウンドチェック... Quarkus入門

source: Would you rather create OIDC tenants programmatically, instead of having to deal with all the required configuration properties in `application.properties` ? Quarkus OIDC offers two options if it is what you prefer to do.
ja_jp: `application.properties` で必要なすべての設定プロパティーを扱う代わりに、プログラムで OIDC テナントを作成したいですか? そのような方法を希望する場合、Quarkus OIDC は 2 つのオプションを提供します。

source: Wouldn't it be nice to configure an external database, but have it *only* used in production, so you could still use Dev Services the rest of the time?
ja_jp: 外部データベースを設定しつつ、 実稼働環境で *のみ* 使用し、それ以外の時は引き続き Dev Services を使えるようにできたら便利だと思いませんか?

source: Wrap construction of a collection to monitor its size:
ja_jp: コレクションのサイズを監視するためにコレクションの構築をラップします。

source: Wrap the LitElement in `observerState`
ja_jp: LitElement を `observerState` でラップします。

source: Wrap the invocation of a `Callable`:
ja_jp: `Callable` の呼び出しをラップします。

source: Wrap the invocation of a `Runnable`:
ja_jp: `Runnable` の呼び出しをラップします。

source: Wrap the managed entity inside a Data transfer object and send it to Kafka. This makes sure that managed entity is not impacted by the Kafka serialization.
ja_jp: 管理対象エンティティをData transferオブジェクトの中に包み込み、Kafkaに送信します。これにより、Kafkaのシリアライズの影響をマネージドエンティティが受けないようにします。

source: Wrap the managed entity inside a Data transfer object and send it to Kafka. This makes sure that managed entity is not impacted by the Kafka serialization. Then await the completion of the operation before returning.
ja_jp: 管理対象エンティティーをデータ転送オブジェクト内にラップし、Kafka に送信します。 これにより、管理対象エンティティーが Kafka のシリアライゼーションの影響を受けなくなります。 その後、操作が完了するまで待ってから戻ります。

source: Wrap the return service value in a `RuntimeServiceBuildItem` for use in a RUNTIME_INIT build step that will start the service.
ja_jp: サービスを開始する RUNTIME_INIT ビルドステップで使用するために、戻りサービス値を `RuntimeServiceBuildItem` にラップします。

source: Write Acknowledgement
ja_jp: 確認応答の書き込み

source: Write New Extensions
ja_jp: 新しいエクステンションの作成

source: Write QuickStart Guides
ja_jp: クイックスタートガイドの執筆

source: Write Wiremock based `QuarkusTestResourceLifecycleManager`, for example:
ja_jp: Wiremockベースの `QuarkusTestResourceLifecycleManager` を例えば以下のように書きます。

source: Write Your First Application
ja_jp: 最初のアプリケーションを書く

source: Write a Quarkus application with a main method
ja_jp: メインメソッドでQuarkusアプリケーションを書く

source: Write a Spring Data Application
ja_jp: Spring Dataアプリケーションの作成

source: Write a Wiremock-based `QuarkusTestResourceLifecycleManager`, for example:
ja_jp: 以下のように、Wiremock ベースの `QuarkusTestResourceLifecycleManager` を記述します。

source: Write a class
ja_jp: クラスを作成する

source: Write a test code as outlined in the following example:
ja_jp: 次の例に示すようにテストコードを記述します。

source: Write clear, concise, and consistent technical information in US English. Write for a global audience with localization, translation, inclusivity, and diversity in mind. Try to use the following grammar styles:
ja_jp: 明確で簡潔、かつ一貫性のある技術情報を米国英語で書いて下さい。ローカライゼーション、翻訳、包括性、多様性を考慮し、グローバルな読者のために書いて下さい。以下の文法スタイルを使用するように心がけて下さい：

source: Write command mode applications that run a task and then terminate
ja_jp: タスクを実行して終了するコマンドモードのアプリケーションを書く

source: Write down your App ID Prefix, then press `Register`:
ja_jp: アプリ ID 接頭辞を書き留めてから、 `Register` を押します。

source: Write down your `Key ID`, download your key and save it to your Quarkus application in `src/main/resources/AuthKey_<KEYID>.p8`:
ja_jp: `Key ID` を書き留めてキーをダウンロードし、 `src/main/resources/AuthKey_<KEYID>.p8` の Quarkus アプリケーションに保存します。

source: Write down your keys, because they will not be displayed again, and press `App Settings`:
ja_jp: キーは再び表示されないので書き留めて、 `App Settings` を押します。

source: Write load scripts
ja_jp: ロードスクリプトの作成

source: Write the SPI loader text file at `resources/META-INF/services` with name `io.opentelemetry.sdk.autoconfigure.spi.traces.ConfigurableSamplerProvider` containing the full qualified name of the `CustomSPISamplerProvider` class.
ja_jp: `resources/META-INF/services` に `io.opentelemetry.sdk.autoconfigure.spi.traces.ConfigurableSamplerProvider` という名前の SPI ローダーテキストファイルを作成し、その中に `CustomSPISamplerProvider` クラスの完全修飾名を記述します。

source: Write the application
ja_jp: アプリケーションの記述

source: Write the config in yml `src/main/resources/application.yml`.
ja_jp: 設定は `src/main/resources/application.yml` ymlに記述してください。

source: Write the test code as described in the <<code-flow-integration-testing-wiremock,Wiremock>> section. The only difference is that `@QuarkusTestResource` is no longer required:
ja_jp: <<code-flow-integration-testing-wiremock,Wiremock>> セクションで説明されているとおりテストコードを作成します。 唯一の違いは、 `@QuarkusTestResource` が不要になったことです。

source: Write the test code, for example:
ja_jp: テストコードを記述します。例を挙げます。

source: Write the test code.
ja_jp: テストコードを記述します。

source: Write your services in Kotlin
ja_jp: Kotlin でサービスを記述する

source: Write your services in Scala
ja_jp: Scala でサービスを記述する

source: Writing Command Mode Applications
ja_jp: コマンドモードアプリケーションの作成

source: Writing Extensions
ja_jp: エクステンションの作成

source: Writing Highly Scalable Reactive REST Services
ja_jp: スケーラブルなリアクティブRESTサービスの書き方

source: Writing JSON REST Services
ja_jp: JSON RESTサービスの実装

source: Writing JSON REST services
ja_jp: JSON RESTサービスの作成

source: Writing Native Applications
ja_jp: ネイティブアプリケーションの作成

source: Writing Quarkus extensions in Eclipse
ja_jp: Eclipse での Quarkus 拡張の書き方

source: Writing REST JSON Services
ja_jp: REST JSONサービスの作成

source: Writing REST Services Reference
ja_jp: RESTサービス作成リファレンス

source: Writing REST Services with Quarkus REST (formerly RESTEasy Reactive)
ja_jp: Quarkus REST（旧RESTEasy Reactive）によるRESTサービスの作成

source: Writing REST Services with RESTEasy Reactive
ja_jp: RESTEasy Reactive を使用して REST サービスを作成する

source: Writing Simple CRUD Applications with Spring Data
ja_jp: Spring DataでシンプルなCRUDアプリケーションを書く

source: Writing Simple REST CRUD Services
ja_jp: シンプルなREST CRUDサービスの書き方

source: Writing Your Own Extension
ja_jp: 独自のエクステンションの作成

source: Writing a Codestart for an extension
ja_jp: エクステンションのCodestartの作成

source: Writing a Dev Service
ja_jp: Dev Service の作成

source: Writing a JAX-RS resource
ja_jp: JAX-RS リソースの書き方

source: Writing a Jakarta REST resource
ja_jp: Jakarta RESTリソースの書き方

source: Writing a Profile
ja_jp: プロフィールの書き方

source: Writing a playbook
ja_jp: プレイブックの作成

source: Writing an Extension Codestart
ja_jp: エクステンション Codestart の作成

source: Writing an Extension Codestart in Quarkus Core
ja_jp: Quarkus Coreでのエクステンション・コードスタートの書き方

source: Writing an Extension Codestart in the Quarkiverse or standalone
ja_jp: QuarkiverseまたはスタンドアロンでのエクステンションCodestartの書き方

source: Writing an application
ja_jp: アプリケーションの作成

source: Writing data
ja_jp: データの書き込み

source: Writing endpoints
ja_jp: エンドポイントの作成

source: Writing entities managed by Hibernate Reactive to Kafka
ja_jp: Hibernate Reactive が管理するエンティティーの Kafka への書き込み

source: Writing entities managed by Hibernate to Kafka
ja_jp: Hibernate が管理するエンティティーの Kafka への書き込み

source: Writing extension with any other than Java and Maven has **not** been tested by the Quarkus team so your mileage may vary if you stray off this path
ja_jp: JavaとMaven以外でエクステンションを作成することは、Quarkusチームによってテストされて *いません* 。 したがって、この方法から外れると、期待通りに動作しない可能性があります。

source: Writing extension with any other than Java and Maven has **not** been tested by the Quarkus team, so your mileage may vary if you stray off this path
ja_jp: Java および Maven 以外でエクステンションを作成することは Quarkus チームによってテストされて *いません*。そのため、このパスから外れると期待通りに動作しない可能性があります。

source: Writing quick scripts using the Quarkus stack becomes easy. Learn more about it in link:/guides/scripting[the Scripting with jbang guide].
ja_jp: Quarkusスタックを使用したクイックスクリプトの作成が簡単になりました。詳細については、 link:/guides/scripting[jbangを使ったスクリプト作成ガイド] を参照してください。

source: Writing section documentation
ja_jp: セクションのドキュメントを書く

source: Writing simpler reactive REST services with Quarkus Virtual Thread support
ja_jp: 仮想スレッドを使ったさらにシンプルなQuarkusでのリアクティブRESTサービスの作成

source: Writing the HTML application
ja_jp: HTMLアプリケーションの作成

source: Writing the application
ja_jp: アプリケーションの記述

source: Writing the documentation
ja_jp: ドキュメントの書き方

source: Writing tips
ja_jp: 作成のコツ

source: Writing to Kafka from an HTTP endpoint
ja_jp: HTTP エンドポイントから Kafka への書き込み

source: Wrong. + First off, just disable the transaction by marking your transaction boundary with `@Transactional(NOT_SUPPORTED)` (or `NEVER` or `SUPPORTS` depending on the semantic you want). + Second, it's again fairy tale that not using transaction is faster. The answer is, it depends on your DB and how many SQL SELECTs you are making. No transaction means the DB does have a single operation transaction context anyway. + Third, when you do several SELECTs, it's better to wrap them in a single transaction because they will all be consistent with one another. Say your DB represents your car dashboard, you can see the number of kilometers remaining and the fuel gauge level. By reading it in one transaction, they will be consistent. If you read one and the other from two different transactions, then they can be inconsistent. It can be more dramatic if you read data related to rights and access management for example.
ja_jp: それは誤りです。+ まず第一に、トランザクションの境界を `@Transactional(NOT_SUPPORTED)` (または `NEVER` または `SUPPORTS` ) でマークすることで、トランザクションを無効にしてください。+ 第二に、トランザクションを使用しない方が速いというのは、またしてもおとぎ話です。答えは、それはDBとSQLのSELECT回数に依存します。トランザクションを使用しないということは、DBが単一操作のトランザクションコンテキストを持っていることを意味します。+ 第三に、複数のSELECTを実行する場合は、一つのトランザクションにまとめる方が全てのSELECTに一貫性が保たれます。DBが車のダッシュボードを表しているとすると、残りキロ数と燃料計のレベルなどを見ることができます。それを1つのトランザクションで読み取ることで、それらは整合性を保つことができます。 もし、2つの異なるトランザクションから一方と他方を読み取れば、それらは矛盾することがあります。例えば、権限やアクセス管理に関連するデータを読み取る場合は、より劇的なことが起こる可能性があります。

source: Wrong. + First off, just disable the transaction by marking your transaction boundary with `@Transactional(NOT_SUPPORTED)` (or `NEVER` or `SUPPORTS` depending on the semantic you want). + Second, it's again fairy tale that not using transaction is faster. The answer is, it depends on your DB and how many SQL SELECTs you are making. No transaction means the DB does have a single operation transaction context anyways. + Third, when you do several SELECTs, it's better to wrap them in a single transaction because they will all be consistent with one another. Say your DB represents your car dashboard, you can see the number of kilometers remaining and the fuel gauge level. By reading it in one transaction, they will be consistent. If you read one and the other from two different transactions, then they can be inconsistent. It can be more dramatic if you read data related to rights and access management for example.
ja_jp: 誤りです。+ まず第一に、トランザクションの境界を `@Transactional(NOT_SUPPORTED)` (または `NEVER` または `SUPPORTS` ) でマークすることで、トランザクションを無効にしてください。+ 第二に、トランザクションを使用しない方が速いというのは、またしてもおとぎ話です。答えは、それはあなたのDBと、あなたが行っているSQL SELECTの数に依存します。トランザクションを使用しないということは、DBはいずれにしても単一操作のトランザクションコンテキストを持っていることを意味します。+ 第三に、複数のSELECTを実行する場合は、それらを一つのトランザクションにまとめる方が良いでしょう。あなたのDBがあなたの車のダッシュボードを表しているとしましょう、あなたは残りのキロ数と燃料計のレベルを見ることができます。それを1つのトランザクションで読み取ることで、それらは一貫したものになります。一方ともう一方を2つの異なるトランザクションから読み取った場合、それらは一貫性のないものになる可能性があります。例えば、権限やアクセス管理に関連するデータを読むと、より劇的になることもあります。

source: X doesn't require https usage in practice, but won't accept your `Website URL` without it, so you can still use ngrok for it.
ja_jp: X は実際には https を使用する必要はありませんが、 https がないと `Website URL` を受け入れないため、 ngrok を引き続き使用できます。

source: X is the new name of Twitter. You can continue using `quarkus.oidc.provider=twitter` for the time being but it might become deprecated in the future.
ja_jp: X は Twitter の新しい名前です。当面は `quarkus.oidc.provider=twitter` を引き続き使用できますが、今後廃止される可能性があります。

source: X provider requires Proof Key for Code Exchange (PKCE) which is supported by the `quarkus.oidc.provider=x` declaration. Quarkus has to encrypt the current PKCE code verifier in a state cookie while the authorization code flow with X is in progress and it will generate a secure random secret key for encrypting it.
ja_jp: X プロバイダーには、 `quarkus.oidc.provider=x` 宣言でサポートされている Proof Key for Code Exchange (PKCE) が必要です。 Quarkus は、X との認可コードフローが進行中に、現在の PKCE コード検証子を状態 Cookie で暗号化する必要があり、 暗号化するための安全なランダム秘密鍵を生成します。

source: XA driver
ja_jp: XA ドライバー

source: XA transactions on reactive datasources are not supported at the moment.
ja_jp: 現時点では、リアクティブデータソース上の XA トランザクションはサポートされていません。

source: XCode provides the required dependencies on macOS:
ja_jp: macOS では、XCode が必要な依存関係を提供します:

source: XML mapping
ja_jp: XMLマッピング

source: XML mapping files are parsed at build time.
ja_jp: XML マッピングファイルは、ビルド時に解析されます。

source: XML mapping with duplicate files in the classpath
ja_jp: クラスパスに重複したファイルがある場合のXMLマッピング

source: XML serialisation
ja_jp: XML シリアライゼーション

source: XML serialization support
ja_jp: XML シリアライゼーションサポート

source: YAML Configuration
ja_jp: YAML設定

source: YAML `null` keys are not included in the assembly of the configuration property name, allowing them to be used in any level for disambiguating configuration keys.
ja_jp: YAML `null` キーは、設定プロパティ名の組み合わせには含まれないため、設定キーの曖昧さを解消するために任意のレベルで使用することができます。

source: YAML `null` keys are not included in the assembly of the configuration property name, allowing them to be used at any level for disambiguating configuration properties.
ja_jp: YAML `null` キーは設定プロパティ名のアセンブリに含まれないので、設定プロパティを曖昧さをなくすためにどのレベルでも使うことができます。

source: YAML and JSON structures can be read in an application.yaml file.
ja_jp: YAMLとJSON構造はapplication.yamlファイルから読み込むことができます。

source: YAML as a Configuration Source.
ja_jp: YAMLを設定ソースとして使用

source: YAML configuration
ja_jp: YAML設定

source: YAML files containing metadata for all documents individually (`docs/target/indexByFile.yaml`) and grouped by document type (`target/indexByType.yaml`).
ja_jp: 全ドキュメント個別のメタデータを含むYAML ( `docs/target/indexByFile.yaml `) とドキュメントタイプ別にグループ化したメタデータを含むYAML ( `target/indexByType.yaml `)。

source: YAML files that list metadata errors by file (`docs/target/errorsByFile.yaml`) and by error type (`docs/target/errorsByType.yaml`)
ja_jp: ファイル別にメタデータのエラーをリストアップするYAMLファイル( `docs/target/errorsByFile.yaml `)と、エラーの種類別にメタデータのエラーをリストアップするYAMLファイル( `docs/target/errorsByType.yaml `)

source: Yep, it works in your Quarkus application, in your IDE, in your tests, because all of these are Quarkus applications. JTA has some bad press for some people. I don't know why. Let's just say that this is not your grandpa's JTA implementation. What we have is perfectly embeddable and lean.
ja_jp: はい、Quarkusアプリケーションでも、IDEでも、テストでも動作します。JTAは一部の人に悪評があります。なぜかはわかりません。これはあなたのおじいちゃんのJTA実装ではないとは言っておきましょう。私たちが持っているものは、完全に埋め込み可能で無駄がありません。

source: Yes
ja_jp: 可

source: Yes it does not compile, `Result` is missing, but we will add it very soon.
ja_jp: はい、これはコンパイル出来ません。 `Result` がありませんが、私たちはすぐに追加します。
